haskell/control_monad.org
#+INCLUDE: ../theme/style.org 
#+TITLE: Module: Control.Monad 

* Control.Monad - Monad Combinators 

 [[https://hackage.haskell.org/package/base-4.8.2.0/docs/Control-Monad.html][Module Documentation]] 

** join

#+BEGIN_SRC haskell 

join :: Monad m => m (m a) -> m a 
join mma = do 
   ma <- mma 
   a  <- ma 
   return a

join mma = 
  mma >>= \ ma -> 
  ma  >>= \ a  ->
    return a 
#+END_SRC

Example:

#+BEGIN_SRC haskell 
> :t join
join :: Monad m => m (m a) -> m a
> 

> join $ Just (Just 10)
Just 10
> join $ Just Nothing
Nothing
> 


-- Equals to concat when applied to lists 
--
> join  [[1, 2], [3], [4, 5, 6]]
[1,2,3,4,5,6]
> 

> concat  [[1, 2], [3], [4, 5, 6]]
[1,2,3,4,5,6]
> 

> join (Right (Right "It is right"))
Right "It is right"
> 
>
> join (Right (Left "It is wrong"))
Left "It is wrong"
> 
> join (Left (Right "It is right"))
Left (Right "It is right")
> 
> join (Left (Left "It is right"))
Left (Left "It is right")
> 

> import Control.Monad.Identity 

> Identity 100
Identity 100
> 

> join (Identity (Identity 20))
Identity 20
> 


#+END_SRC

** liftM

liftM is equivalent to fmap. Apply a function to monad 

#+BEGIN_SRC haskell 
liftM :: Monad m => (a -> b) -> m a -> m b =
liftM  f ma  = do  
  a <- ma
  return $ f a
#+END_SRC

#+BEGIN_SRC haskell

> fmap (+1) [1, 2, 3, 4]
[2,3,4,5]
> fmap (+1) (Just 10)
Just 11
> fmap (+1) Nothing
Nothing
> 

> liftM (+1) [1, 2, 3, 4]
[2,3,4,5]
> 
> liftM (+1) (Just 10)
Just 11
> 
> liftM (+1) Nothing
Nothing
> 

> liftM lines $ readFile "/etc/lsb-release"
["DISTRIB_ID=Ubuntu","DISTRIB_RELEASE=15.04","DISTRIB_CODENAME=vivid","DISTRIB_DESCRIPTION=\"Ubuntu 15.04\""]
> 
> liftM length $ liftM lines $ readFile "/etc/lsb-release"
4
> 

> liftM (length . lines ) $ readFile "/etc/lsb-release"
4
> 
> liftM (length . lines ) . readFile $ "/etc/lsb-release"
4
> 
> let countLinesOfFile = liftM (length . lines ) . readFile
>
> countLinesOfFile  "/etc/lsb-release"
4
> 

> import Control.Monad.Identity 

> liftM (+10) (Identity 20)
Identity 30
> 


#+END_SRC

