haskell/control_monad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Module: Control.Monad</title>
<!-- 2017-03-04 sáb 14:19 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="arch" />
<link href='/theme/style.css' rel='stylesheet'>


</head>
<body>
<div id="content">
<h1 class="title">Module: Control.Monad</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Control.Monad - Monad Combinators</a>
<ul>
<li><a href="#sec-1-1">1.1. join</a></li>
<li><a href="#sec-1-2">1.2. liftM</a></li>
<li><a href="#sec-1-3">1.3. liftM2</a></li>
<li><a href="#sec-1-4">1.4. mapM</a></li>
<li><a href="#sec-1-5">1.5. mapM_</a></li>
<li><a href="#sec-1-6">1.6. forM</a></li>
<li><a href="#sec-1-7">1.7. forM_</a></li>
<li><a href="#sec-1-8">1.8. replicateM</a></li>
<li><a href="#sec-1-9">1.9. replicateM_</a></li>
<li><a href="#sec-1-10">1.10. sequence</a></li>
<li><a href="#sec-1-11">1.11. sequence_</a></li>
<li><a href="#sec-1-12">1.12. foldM</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Control.Monad - Monad Combinators</h2>
<div class="outline-text-2" id="text-1">
<p>
This module provides functions to manipulate monads. 
</p>

<p>
<a href="https://hackage.haskell.org/package/base-4.8.2.0/docs/Control-Monad.html">Module Documentation</a> 
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> join</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">join</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> m (m a) <span class="org-haskell-operator">-&gt;</span> m a 
<span class="org-haskell-definition">join</span> mma <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span> 
   ma <span class="org-haskell-operator">&lt;-</span> mma 
   a  <span class="org-haskell-operator">&lt;-</span> ma 
   return a

<span class="org-haskell-definition">join</span> mma <span class="org-haskell-operator">=</span> 
  mma <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span> ma <span class="org-haskell-operator">-&gt;</span> 
  ma  <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span> a  <span class="org-haskell-operator">-&gt;</span>
    return a
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t join
<span class="org-haskell-definition">join</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> m (m a) <span class="org-haskell-operator">-&gt;</span> m a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> join <span class="org-haskell-definition">$</span> <span class="org-haskell-type">Just</span> (<span class="org-haskell-type">Just</span> 10)
<span class="org-haskell-constructor">Just</span> 10
<span class="org-haskell-operator">&gt;</span> join <span class="org-haskell-definition">$</span> <span class="org-haskell-constructor">Just</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">-- </span><span class="org-comment">Equals to concat when applied to lists </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">join</span>  [[1, 2], [3], [4, 5, 6]]
[1,2,3,4,5,6]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">concat</span>  [[1, 2], [3], [4, 5, 6]]
[1,2,3,4,5,6]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">join</span> (<span class="org-haskell-constructor">Right</span> (<span class="org-haskell-constructor">Right</span> <span class="org-string">"It is right"</span>))
<span class="org-haskell-constructor">Right</span> <span class="org-string">"It is right"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">join</span> (<span class="org-haskell-constructor">Right</span> (<span class="org-haskell-constructor">Left</span> <span class="org-string">"It is wrong"</span>))
<span class="org-haskell-constructor">Left</span> <span class="org-string">"It is wrong"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">join</span> (<span class="org-haskell-constructor">Left</span> (<span class="org-haskell-constructor">Right</span> <span class="org-string">"It is right"</span>))
<span class="org-haskell-constructor">Left</span> (<span class="org-haskell-constructor">Right</span> <span class="org-string">"It is right"</span>)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">join</span> (<span class="org-haskell-constructor">Left</span> (<span class="org-haskell-constructor">Left</span> <span class="org-string">"It is right"</span>))
<span class="org-haskell-constructor">Left</span> (<span class="org-haskell-constructor">Left</span> <span class="org-string">"It is right"</span>)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad.Identity</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">Identity</span> 100
<span class="org-haskell-constructor">Identity</span> 100
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">join</span> (<span class="org-haskell-constructor">Identity</span> (<span class="org-haskell-constructor">Identity</span> 20))
<span class="org-haskell-constructor">Identity</span> 20
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> liftM</h3>
<div class="outline-text-3" id="text-1-2">
<p>
liftM is equivalent to fmap. Apply a function to monad 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">liftM</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> m a <span class="org-haskell-operator">-&gt;</span> m b <span class="org-haskell-operator">=</span>
<span class="org-haskell-definition">liftM</span>  f ma  <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>  
  a <span class="org-haskell-operator">&lt;-</span> ma
  return <span class="org-haskell-operator">$</span> f a
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">+</span>1) [1, 2, 3, 4]
[2,3,4,5]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">+</span>1) (<span class="org-haskell-constructor">Just</span> 10)
<span class="org-haskell-constructor">Just</span> 11
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> (<span class="org-haskell-operator">+</span>1) <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM</span> (<span class="org-haskell-operator">+</span>1) [1, 2, 3, 4]
[2,3,4,5]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM</span> (<span class="org-haskell-operator">+</span>1) (<span class="org-haskell-constructor">Just</span> 10)
<span class="org-haskell-constructor">Just</span> 11
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM</span> (<span class="org-haskell-operator">+</span>1) <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM</span> lines <span class="org-haskell-operator">$</span> readFile <span class="org-string">"/etc/lsb-release"</span>
[<span class="org-string">"DISTRIB_ID=Ubuntu"</span>,<span class="org-string">"DISTRIB_RELEASE=15.04"</span>,<span class="org-string">"DISTRIB_CODENAME=vivid"</span>,<span class="org-string">"DISTRIB_DESCRIPTION=\"Ubuntu 15.04\""</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM</span> length <span class="org-haskell-operator">$</span> liftM lines <span class="org-haskell-operator">$</span> readFile <span class="org-string">"/etc/lsb-release"</span>
4
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM</span> (length <span class="org-haskell-operator">.</span> lines ) <span class="org-haskell-operator">$</span> readFile <span class="org-string">"/etc/lsb-release"</span>
4
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM</span> (length <span class="org-haskell-operator">.</span> lines ) <span class="org-haskell-operator">.</span> readFile <span class="org-haskell-operator">$</span> <span class="org-string">"/etc/lsb-release"</span>
4
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> countLinesOfFile <span class="org-haskell-operator">=</span> liftM (length <span class="org-haskell-operator">.</span> lines ) <span class="org-haskell-operator">.</span> readFile
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">countLinesOfFile</span>  <span class="org-string">"/etc/lsb-release"</span>
4
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad.Identity</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM</span> (<span class="org-haskell-operator">+</span>10) (<span class="org-haskell-constructor">Identity</span> 20)
<span class="org-haskell-constructor">Identity</span> 30
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
