haskell/control_monad.org
** liftM2

Apply a function to two monads. 

#+BEGIN_SRC haskell 
liftM2 :: Monad m => (a -> b -> c) -> m a -> m b -> m c
liftM2 f ma mb = do 
  a <- ma 
  b <- mb 
  return (f a b)

liftM2 f ma mb = 
  ma >>= \a ->
  mb >>= \b -> 
  return (f a b)
#+END_SRC  

Examples:

#+BEGIN_SRC haskell
> liftM2 (+) (Just 3) (Just 4)
Just 7
> liftM2 (+) (Just 3) Nothing
Nothing
> liftM2 (+) Nothing  Nothing
Nothing
> 

> liftM2 (+) (Right 10) (Right 20)
Right 30
>
> liftM2 (+) (Right 10) (Left "Error parser failed")
Left "Error parser failed"
> 
> liftM2 (+) (Left "Invalid number") (Right 20)
Left "Invalid number"
> 
> liftM2 (+) (Left "Invalid number") (Left "Error parser failed")
Left "Invalid number"
> 

> liftM2 (+) [1, 2, 3, 4] [9, 8, 10]
[10,9,11,11,10,12,12,11,13,13,12,14]
> 

> import Control.Identity.Monad
>
> liftM2 (+) (Identity 20) (Identity 30)
Identity 50
> 

#+END_SRC

