haskell/control_monad.html

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> liftM2</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Apply a function to two monads. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">liftM2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c) <span class="org-haskell-operator">-&gt;</span> m a <span class="org-haskell-operator">-&gt;</span> m b <span class="org-haskell-operator">-&gt;</span> m c
<span class="org-haskell-definition">liftM2</span> f ma mb <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span> 
  a <span class="org-haskell-operator">&lt;-</span> ma 
  b <span class="org-haskell-operator">&lt;-</span> mb 
  return (f a b)

<span class="org-haskell-definition">liftM2</span> f ma mb <span class="org-haskell-operator">=</span> 
  ma <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>a <span class="org-haskell-operator">-&gt;</span>
  mb <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>b <span class="org-haskell-operator">-&gt;</span> 
  return (f a b)
</pre>
</div>

<p>
Examples:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Just</span> 3) (<span class="org-haskell-constructor">Just</span> 4)
<span class="org-haskell-constructor">Just</span> 7
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Just</span> 3) <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM2</span> (<span class="org-haskell-operator">+</span>) <span class="org-haskell-constructor">Nothing</span>  <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Right</span> 10) (<span class="org-haskell-constructor">Right</span> 20)
<span class="org-haskell-constructor">Right</span> 30
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Right</span> 10) (<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error parser failed"</span>)
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error parser failed"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Left</span> <span class="org-string">"Invalid number"</span>) (<span class="org-haskell-constructor">Right</span> 20)
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Invalid number"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Left</span> <span class="org-string">"Invalid number"</span>) (<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error parser failed"</span>)
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Invalid number"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM2</span> (<span class="org-haskell-operator">+</span>) [1, 2, 3, 4] [9, 8, 10]
[10,9,11,11,10,12,12,11,13,13,12,14]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Identity.Monad</span>
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">liftM2</span> (<span class="org-haskell-operator">+</span>) (<span class="org-haskell-constructor">Identity</span> 20) (<span class="org-haskell-constructor">Identity</span> 30)
<span class="org-haskell-constructor">Identity</span> 50
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
