haskell/control_monad.org
** mapM

Map each element of a structure to a monadic action, evaluate these
actions from left to right, and collect the results. For a version
that ignores the results see mapM_. (documentation) 

#+BEGIN_SRC haskell 
-- Haskell 7.6.3 
-- 
mapM :: Monad m => (a -> m b) -> [a] -> m [b]
mapM f ts = sequence (map f ts)

-- Haskell 7.10.2 
-- 
mapM :: (a -> m b) -> t a -> m (t b)
mapM f ts = sequence (fmap f ts)
#+END_SRC

Example:

#+BEGIN_SRC haskell 

> import qualified Data.Maybe as M
> import qualified System.Environment as E


-- Signature in Haskell 7.6.3
--
> :t mapM
mapM :: Monad m => (a -> m b) -> [a] -> m [b]
> 

> :t E.lookupEnv 
E.lookupEnv :: String -> IO (Maybe String)
> 

-- Singature in Haskell 7.10.2 (mapM is generalized). 
-- 
> :t mapM
mapM :: (Monad m, Traversable t) => (a -> m b) -> t a -> m (t b)
> 

> mapM E.lookupEnv ["HOME", "a1", "b1", "LANGUAGE", "PYTHONPATH"]
[Just "/home/tux",Nothing,Nothing,Just "en_US",Just "/home/tux/lib"]
> 

> :t M.catMaybes 
M.catMaybes :: [Maybe a] -> [a]
> 

> fmap M.catMaybes  $ mapM E.lookupEnv ["HOME", "a1", "b1", "LANGUAGE", "PYTHONPATH"]
["/home/tux","en_US","/home/tux/lib"]
> 
> :t fmap M.catMaybes  $ mapM E.lookupEnv ["HOME", "a1", "b1", "LANGUAGE", "PYTHONPATH"]
fmap M.catMaybes  $ mapM E.lookupEnv ["HOME", "a1", "b1", "LANGUAGE", "PYTHONPATH"]
  :: IO [String]
> 


> let selector = \x -> if x > 10 then Just (3 + x) else Nothing
>
> :t selector 
selector :: (Num a, Ord a) => a -> Maybe a
> 

> mapM selector (Just 20)
Just (Just 23)
> mapM selector Nothing
Just Nothing
> mapM selector (Just 3)
Nothing
> 

> mapM selector [1, 2, 3, 4]
Nothing
> 

> mapM selector [ 20, 30, 40]
Just [23,33,43]
> 

#+END_SRC

