haskell/control_monad.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> mapM</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Map each element of a structure to a monadic action, evaluate these
actions from left to right, and collect the results. For a version
that ignores the results see mapM_. (documentation) 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.6.3 </span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-definition">mapM</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> m [b]
<span class="org-haskell-definition">mapM</span> f ts <span class="org-haskell-operator">=</span> sequence (map f ts)

<span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.10.2 </span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-definition">mapM</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m (t b)
<span class="org-haskell-definition">mapM</span> f ts <span class="org-haskell-operator">=</span> sequence (fmap f ts)
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">Data.Maybe</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">M</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-keyword">qualified</span> <span class="org-haskell-constructor">System.Environment</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">E</span>


<span class="org-comment-delimiter">-- </span><span class="org-comment">Signature in Haskell 7.6.3</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t mapM
<span class="org-haskell-definition">mapM</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> m [b]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t E.lookupEnv 
E<span class="org-haskell-definition">.</span>lookupEnv <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">IO</span> (<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">String</span>)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Singature in Haskell 7.10.2 (mapM is generalized). </span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t mapM
<span class="org-haskell-definition">mapM</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monad</span> m, <span class="org-haskell-type">Traversable</span> t) <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m (t b)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM</span> E.lookupEnv [<span class="org-string">"HOME"</span>, <span class="org-string">"a1"</span>, <span class="org-string">"b1"</span>, <span class="org-string">"LANGUAGE"</span>, <span class="org-string">"PYTHONPATH"</span>]
[<span class="org-haskell-constructor">Just</span> <span class="org-string">"/home/tux"</span>,<span class="org-haskell-constructor">Nothing</span>,<span class="org-haskell-constructor">Nothing</span>,<span class="org-haskell-constructor">Just</span> <span class="org-string">"en_US"</span>,<span class="org-haskell-constructor">Just</span> <span class="org-string">"/home/tux/lib"</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t M.catMaybes 
M<span class="org-haskell-definition">.</span>catMaybes <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Maybe</span> a] <span class="org-haskell-operator">-&gt;</span> [a]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fmap</span> M.catMaybes  <span class="org-haskell-operator">$</span> mapM E.lookupEnv [<span class="org-string">"HOME"</span>, <span class="org-string">"a1"</span>, <span class="org-string">"b1"</span>, <span class="org-string">"LANGUAGE"</span>, <span class="org-string">"PYTHONPATH"</span>]
[<span class="org-string">"/home/tux"</span>,<span class="org-string">"en_US"</span>,<span class="org-string">"/home/tux/lib"</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t fmap M.catMaybes  <span class="org-haskell-operator">$</span> mapM E.lookupEnv [<span class="org-string">"HOME"</span>, <span class="org-string">"a1"</span>, <span class="org-string">"b1"</span>, <span class="org-string">"LANGUAGE"</span>, <span class="org-string">"PYTHONPATH"</span>]
<span class="org-haskell-definition">fmap</span> M.catMaybes  <span class="org-haskell-operator">$</span> mapM E.lookupEnv [<span class="org-string">"HOME"</span>, <span class="org-string">"a1"</span>, <span class="org-string">"b1"</span>, <span class="org-string">"LANGUAGE"</span>, <span class="org-string">"PYTHONPATH"</span>]
  <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> [<span class="org-haskell-type">String</span>]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> selector <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">if</span> x <span class="org-haskell-operator">&gt;</span> 10 <span class="org-haskell-keyword">then</span> <span class="org-haskell-constructor">Just</span> (3 <span class="org-haskell-operator">+</span> x) <span class="org-haskell-keyword">else</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t selector 
<span class="org-haskell-definition">selector</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Num</span> a, <span class="org-haskell-type">Ord</span> a) <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Maybe</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM</span> selector (<span class="org-haskell-type">Just</span> 20)
<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Just</span> 23)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM</span> selector <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Just</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM</span> selector (<span class="org-haskell-constructor">Just</span> 3)
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM</span> selector [1, 2, 3, 4]
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM</span> selector [ 20, 30, 40]
<span class="org-haskell-constructor">Just</span> [23,33,43]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
