haskell/control_monad.org
** mapM_

#+BEGIN_SRC haskell

-- Haskell 7.6.3
mapM_ :: Monad m => (a -> m b) -> [a] -> m ()
mapM_ fn ta = sequence_ $ map fn ta 

-- Haskell 7.10.2  - Generalized version of old mapM_
--
mapM_ :: (Monad m, Foldable t) => (a -> m b) -> t a -> m ()
matM_ fn ta =  sequence_ $ fmap fn ta 
#+END_SRC


Example: 

#+BEGIN_SRC haskell 
> mapM_ putStrLn ["line 1", "line 3", "line 4"]
line 1
line 3
line 4
>  


-- Lines bellow only Haskell 7.10.2 and compatible. 
--
> mapM_ putStrLn (Just "line")
line
>
> mapM_ putStrLn Nothing
> 

> mapM_ putStrLn (Right "line")
line
> 
> mapM_ putStrLn (Left "error BSOD 0x01002234")
> 


> sequence_ $ fmap putStrLn (Just "line")
line
> sequence_ $ fmap putStrLn Nothing
> 
> sequence_ $ fmap putStrLn ["line 1", "line 2", "line 3"]
line 1
line 2
line 3
> 

#+END_SRC

** forM

#+BEGIN_SRC haskell 
-- Haskell 7.10.2  
-- 
forM :: (Monad m, Traversable t) => t a -> (a -> m b) -> m (t b)
forM = flip mapM 
#+END_SRC

Example:

#+BEGIN_SRC haskell 


> forM  ["HOME", "LANGUAGE", "LC_TIME", "dummy"] E.lookupEnv  
[Just "/home/tux",Just "en_US",Just "pt_BR.UTF-8",Nothing]
> 
> :t forM  ["HOME", "LANGUAGE", "LC_TIME", "dummy"] E.lookupEnv  
forM  ["HOME", "LANGUAGE", "LC_TIME", "dummy"] E.lookupEnv
  :: IO [Maybe String]
> 

> forM  ["/etc/issue.net", "/etc/issue", "/proc/cmdline"] readFile
["Ubuntu 15.04\n","Ubuntu 15.04 \\n \\l\n\n","BOOT_IMAGE=/boot/vmlinuz-3.19.0-39-generic ..."]
> 

> forM   (Just "/etc/issue.net") readFile  
Just "Ubuntu 15.04\n"
>
> :t forM   (Just "/etc/issue.net") readFile  
forM   (Just "/etc/issue.net") readFile :: IO (Maybe String)
> 

> forM  Nothing readFile  
Nothing
> 


> forM (Right "/etc/issue.net") readFile  
Right "Ubuntu 15.04\n"
> 
> forM (Left "Fatal kernel error! System shutdown!!") readFile  
Left "Fatal kernel error! System shutdown!!"
> 



#+END_SRC

** forM_

#+BEGIN_SRC haskell 

-- Haskell 7.6.3 
--
forM_ :: (Monad m, Foldable t) => t a -> (a -> m b) -> m ()
forM_ = flip mapM_

> forM_ [1, 2, 3, 4, 5] $ \ n -> putStrLn $ show n
1
2
3
4
5
> 
> forM_ [1, 2, 3, 4, 5] ( \ n -> putStrLn ( show n))
1
2
3
4
5
> 

> forM_ (Just 10) $ \ n -> putStrLn $ show n
10
> 
> forM_ Nothing $ \ n -> putStrLn $ show n
> 

> forM_ (Right 1000) $ \ n -> putStrLn $ show n
1000
> 
> forM_ (Left "Fatal Kernel Error") $ \ n -> putStrLn $ show n
> 

#+END_SRC


Example:

#+BEGIN_SRC haskell

#+END_SRC

