haskell/control_monad.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> mapM_</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.6.3</span>
<span class="org-haskell-definition">mapM_</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> m <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">mapM_</span> fn ta <span class="org-haskell-operator">=</span> sequence_ <span class="org-haskell-operator">$</span> map fn ta 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.10.2  - Generalized version of old mapM_</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-definition">mapM_</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monad</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">matM_</span> fn ta <span class="org-haskell-operator">=</span>  sequence_ <span class="org-haskell-operator">$</span> fmap fn ta
</pre>
</div>


<p>
Example: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> putStrLn [<span class="org-string">"line 1"</span>, <span class="org-string">"line 3"</span>, <span class="org-string">"line 4"</span>]
<span class="org-haskell-definition">line</span> 1
<span class="org-haskell-definition">line</span> 3
<span class="org-haskell-definition">line</span> 4
<span class="org-haskell-operator">&gt;</span>  


<span class="org-comment-delimiter">-- </span><span class="org-comment">Lines bellow only Haskell 7.10.2 and compatible. </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> putStrLn (<span class="org-haskell-constructor">Just</span> <span class="org-string">"line"</span>)
line
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> putStrLn <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> putStrLn (<span class="org-haskell-constructor">Right</span> <span class="org-string">"line"</span>)
line
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mapM_</span> putStrLn (<span class="org-haskell-constructor">Left</span> <span class="org-string">"error BSOD 0x01002234"</span>)
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> sequence_ <span class="org-haskell-definition">$</span> fmap putStrLn (<span class="org-haskell-constructor">Just</span> <span class="org-string">"line"</span>)
line
<span class="org-haskell-operator">&gt;</span> sequence_ <span class="org-haskell-definition">$</span> fmap putStrLn <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> sequence_ <span class="org-haskell-definition">$</span> fmap putStrLn [<span class="org-string">"line 1"</span>, <span class="org-string">"line 2"</span>, <span class="org-string">"line 3"</span>]
<span class="org-haskell-definition">line</span> 1
<span class="org-haskell-definition">line</span> 2
<span class="org-haskell-definition">line</span> 3
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> forM</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.10.2  </span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-definition">forM</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monad</span> m, <span class="org-haskell-type">Traversable</span> t) <span class="org-haskell-operator">=&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> m (t b)
<span class="org-haskell-definition">forM</span> <span class="org-haskell-operator">=</span> flip mapM
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM</span>  [<span class="org-string">"HOME"</span>, <span class="org-string">"LANGUAGE"</span>, <span class="org-string">"LC_TIME"</span>, <span class="org-string">"dummy"</span>] E.lookupEnv  
[<span class="org-haskell-constructor">Just</span> <span class="org-string">"/home/tux"</span>,<span class="org-haskell-constructor">Just</span> <span class="org-string">"en_US"</span>,<span class="org-haskell-constructor">Just</span> <span class="org-string">"pt_BR.UTF-8"</span>,<span class="org-haskell-constructor">Nothing</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t forM  [<span class="org-string">"HOME"</span>, <span class="org-string">"LANGUAGE"</span>, <span class="org-string">"LC_TIME"</span>, <span class="org-string">"dummy"</span>] E.lookupEnv  
<span class="org-haskell-definition">forM</span>  [<span class="org-string">"HOME"</span>, <span class="org-string">"LANGUAGE"</span>, <span class="org-string">"LC_TIME"</span>, <span class="org-string">"dummy"</span>] E.lookupEnv
  <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> [<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">String</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM</span>  [<span class="org-string">"/etc/issue.net"</span>, <span class="org-string">"/etc/issue"</span>, <span class="org-string">"/proc/cmdline"</span>] readFile
[<span class="org-string">"Ubuntu 15.04\n"</span>,<span class="org-string">"Ubuntu 15.04 \\n \\l\n\n"</span>,<span class="org-string">"BOOT_IMAGE=/boot/vmlinuz-3.19.0-39-generic ..."</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM</span>   (<span class="org-haskell-constructor">Just</span> <span class="org-string">"/etc/issue.net"</span>) readFile  
<span class="org-haskell-constructor">Just</span> <span class="org-string">"Ubuntu 15.04\n"</span>
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t forM   (<span class="org-haskell-constructor">Just</span> <span class="org-string">"/etc/issue.net"</span>) readFile  
<span class="org-haskell-definition">forM</span>   (<span class="org-haskell-constructor">Just</span> <span class="org-string">"/etc/issue.net"</span>) readFile <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> (<span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">String</span>)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM</span>  <span class="org-haskell-type">Nothing</span> readFile  
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM</span> (<span class="org-haskell-constructor">Right</span> <span class="org-string">"/etc/issue.net"</span>) readFile  
<span class="org-haskell-constructor">Right</span> <span class="org-string">"Ubuntu 15.04\n"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM</span> (<span class="org-haskell-constructor">Left</span> <span class="org-string">"Fatal kernel error! System shutdown!!"</span>) readFile  
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Fatal kernel error! System shutdown!!"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> forM_</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.6.3 </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-definition">forM_</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monad</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> m <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">forM_</span> <span class="org-haskell-operator">=</span> flip mapM_

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM_</span> [1, 2, 3, 4, 5] <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> n <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-haskell-operator">$</span> show n
1
2
3
4
5
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM_</span> [1, 2, 3, 4, 5] ( <span class="org-haskell-operator">\</span> n <span class="org-haskell-operator">-&gt;</span> putStrLn ( show n))
1
2
3
4
5
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM_</span> (<span class="org-haskell-constructor">Just</span> 10) <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> n <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-haskell-operator">$</span> show n
10
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM_</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> n <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-haskell-operator">$</span> show n
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM_</span> (<span class="org-haskell-constructor">Right</span> 1000) <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> n <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-haskell-operator">$</span> show n
1000
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">forM_</span> (<span class="org-haskell-constructor">Left</span> <span class="org-string">"Fatal Kernel Error"</span>) <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span> n <span class="org-haskell-operator">-&gt;</span> putStrLn <span class="org-haskell-operator">$</span> show n
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"></pre>
</div>
</div>
</div>
