haskell/control_monad.org
** replicateM

Replicate a monad n times getting the results.

#+BEGIN_SRC haskell
replicateM :: Monad m => Int -> m a -> m [a]
replicateM n x    = sequence (replicate n x)
#+END_SRC

Example:

#+BEGIN_SRC haskell
> replicateM 4 (Just 3)
Just [3,3,3,3]
> 
> replicateM 4 Nothing
Nothing
> 

> replicateM 3 (Right 2)
Right [2,2,2]
> replicateM 3 (Left "Error: 0x902323EABC")
Left "Error: 0x902323EABC"
> 


> replicateM 3 [1, 2]
[[1,1,1],[1,1,2],[1,2,1],[1,2,2],[2,1,1],[2,1,2],[2,2,1],[2,2,2]]
> 

> :t replicateM 3 getLine
replicateM 3 getLine :: IO [String]
> 
>
> replicateM 3 getLine
line1
line2
line3
["line1","line2","line3"]
> 

> lines <- replicateM 3 getLine
line1
line2
line3
> lines
["line1","line2","line3"]
> :t lines
lines :: [String]
> 

> import Control.Monad.Identity 

> replicateM 6 (Identity 2)
Identity [2,2,2,2,2,2]
> 

#+END_SRC

** replicateM_

Like replicateM, but throw away the result.

#+BEGIN_SRC haskell 
replicateM_ :: Monad m => Int -> m a -> m ()
replicateM_ n x   = sequence_ (replicate n x)
#+END_SRC

Example:

#+BEGIN_SRC haskell
> replicateM_ 3 (putStrLn "hello world")
hello world
hello world
hello world
> 
> :t replicateM_ 3 (putStrLn "hello world")
replicateM_ 3 (putStrLn "hello world") :: IO ()
> 

#+END_SRC

