haskell/control_monad.html

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> replicateM</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Replicate a monad n times getting the results.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">replicateM</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> m a <span class="org-haskell-operator">-&gt;</span> m [a]
<span class="org-haskell-definition">replicateM</span> n x    <span class="org-haskell-operator">=</span> sequence (replicate n x)
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicateM</span> 4 (<span class="org-haskell-constructor">Just</span> 3)
<span class="org-haskell-constructor">Just</span> [3,3,3,3]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicateM</span> 4 <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicateM</span> 3 (<span class="org-haskell-constructor">Right</span> 2)
<span class="org-haskell-constructor">Right</span> [2,2,2]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicateM</span> 3 (<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: 0x902323EABC"</span>)
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error: 0x902323EABC"</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicateM</span> 3 [1, 2]
[[1,1,1],[1,1,2],[1,2,1],[1,2,2],[2,1,1],[2,1,2],[2,2,1],[2,2,2]]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t replicateM 3 getLine
<span class="org-haskell-definition">replicateM</span> 3 getLine <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> [<span class="org-haskell-type">String</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicateM</span> 3 getLine
line1
line2
line3
[<span class="org-string">"line1"</span>,<span class="org-string">"line2"</span>,<span class="org-string">"line3"</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> lines <span class="org-haskell-operator">&lt;-</span> replicateM 3 getLine
line1
line2
line3
<span class="org-haskell-operator">&gt;</span> lines
[<span class="org-string">"line1"</span>,<span class="org-string">"line2"</span>,<span class="org-string">"line3"</span>]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t lines
<span class="org-haskell-definition">lines</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">String</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad.Identity</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicateM</span> 6 (<span class="org-haskell-constructor">Identity</span> 2)
<span class="org-haskell-constructor">Identity</span> [2,2,2,2,2,2]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> replicateM_</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Like replicateM, but throw away the result.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">replicateM_</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> m a <span class="org-haskell-operator">-&gt;</span> m <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">replicateM_</span> n x   <span class="org-haskell-operator">=</span> sequence_ (replicate n x)
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicateM_</span> 3 (putStrLn <span class="org-string">"hello world"</span>)
<span class="org-haskell-definition">hello</span> world
<span class="org-haskell-definition">hello</span> world
<span class="org-haskell-definition">hello</span> world
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t replicateM_ 3 (putStrLn <span class="org-string">"hello world"</span>)
<span class="org-haskell-definition">replicateM_</span> 3 (putStrLn <span class="org-string">"hello world"</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
