haskell/control_monad.org
** sequence

Evaluate each monadic action in the structure from left to right, and
collect the results. For a version that ignores the results see
sequence_.

#+BEGIN_SRC haskell 
-- Implementation Haskell 7.6.3
-- 
-- Source: http://kodu.ut.ee/~varmo/FP2007/slides/loeng13.pdf
-- 
sequence :: Monad m => [m a] -> m [a]
sequence = foldr mcons (return [])
    where 
       mcons p q = 
          p >>= \x -> 
          q >>= \y -> 
           return (x:y)

#+END_SRC

Example:

#+BEGIN_SRC haskell 

-- Haskell 7.6.3 
--
> :t sequence
sequence :: Monad m => [m a] -> m [a]
> 

-- Haskell 7.10.2 
-- 
> :t sequence
sequence :: (Monad m, Traversable t) => t (m a) -> m (t a)
> 

> sequence [[1], [2, 3, 4], [], [4], [], [], [20, 30]]
[]
> sequence [[1], [2, 3, 4],  [4],  [20, 30]]
[[1,2,4,20],[1,2,4,30],[1,3,4,20],[1,3,4,30],[1,4,4,20],[1,4,4,30]]
> 
> sequence [[2, 3, 4],  [4],  [20, 30]]
[[2,4,20],[2,4,30],[3,4,20],[3,4,30],[4,4,20],[4,4,30]]
> 

-- Haskell 7.6.3 (Sequence only works for lists)
-- 
> sequence (Just [1, 2, 3, 4])

<interactive>:8:11:
    Couldn't match expected type `[m0 a0]'
                with actual type `Maybe [t0]'
    In the return type of a call of `Just'

--- Haskell 7.10.2 (Sequence was generalized)
---
> sequence (Just [1, 2, 3, 4])
[Just 1,Just 2,Just 3,Just 4]
> 



> sequence [Just 1, Just 2, Just 3, Just 4] 
Just [1,2,3,4]
> 
>
> sequence [Just 1, Just 2, Just 3, Nothing, Just 4, Nothing] 
Nothing
> 

> sequence [Right 1, Right 2, Right 3, Right 4]
Right [1,2,3,4] 
>
> sequence [Right 10, Left "Error 0", Left "Error 1", Left "Error 2"] 
Left "Error 0"
> 
> sequence [Right 10, Right 20, Left "Error 1", Right 4] 
Left "Error 1"
> 

> :t [putStrLn "line1", putStrLn "line2", putStrLn "line3"]
[putStrLn "line1", putStrLn "line2", putStrLn "line3"] :: [IO ()]
> 
> sequence [putStrLn "line1", putStrLn "line2", putStrLn "line3"]
line1
line2
line3
[(),(),()]
> 

> let inputNunmber = getLine >>= \ str -> return $ (read str :: Integer)
> 
> :t inputNunmber 
inputNunmber :: IO Integer
> 
> let actions = [inputNunmber, inputNunmber, inputNunmber]
> :t actions 
actions :: [IO Integer]
> 

 -- Only works in the repl (<-) to extract content from IO Monad.

> out <- sequence actions 
23
100
200
> out
[23,100,200]
> :t out
out :: [Integer]
> 

> sequence actions 
200
30
50
[200,30,50]
> :t sequence actions 
sequence actions :: IO [Integer]
> 

> import Control.Monad.Identity
>
> sequence [Identity 20, Identity 10, Identity 30]
Identity [20,10,30]
> 
#+END_SRC

