haskell/control_monad.html

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> sequence</h3>
<div class="outline-text-3" id="text-1-10">
<p>
Evaluate each monadic action in the structure from left to right, and
collect the results. For a version that ignores the results see
sequence_.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Implementation Haskell 7.6.3</span>
<span class="org-comment-delimiter">-- </span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">Source: http://kodu.ut.ee/~varmo/FP2007/slides/loeng13.pdf</span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-definition">sequence</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> [m a] <span class="org-haskell-operator">-&gt;</span> m [a]
<span class="org-haskell-definition">sequence</span> <span class="org-haskell-operator">=</span> foldr mcons (return <span class="org-haskell-constructor">[]</span>)
    <span class="org-haskell-keyword">where</span> 
       mcons p q <span class="org-haskell-operator">=</span> 
          p <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 
          q <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span>y <span class="org-haskell-operator">-&gt;</span> 
           return (x<span class="org-haskell-constructor">:</span>y)
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.6.3 </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t sequence
<span class="org-haskell-definition">sequence</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> [m a] <span class="org-haskell-operator">-&gt;</span> m [a]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.10.2 </span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t sequence
<span class="org-haskell-definition">sequence</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monad</span> m, <span class="org-haskell-type">Traversable</span> t) <span class="org-haskell-operator">=&gt;</span> t (m a) <span class="org-haskell-operator">-&gt;</span> m (t a)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> [[1], [2, 3, 4], <span class="org-haskell-constructor">[]</span>, [4], <span class="org-haskell-constructor">[]</span>, <span class="org-haskell-constructor">[]</span>, [20, 30]]
<span class="org-haskell-constructor">[]</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> [[1], [2, 3, 4],  [4],  [20, 30]]
[[1,2,4,20],[1,2,4,30],[1,3,4,20],[1,3,4,30],[1,4,4,20],[1,4,4,30]]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> [[2, 3, 4],  [4],  [20, 30]]
[[2,4,20],[2,4,30],[3,4,20],[3,4,30],[4,4,20],[4,4,30]]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.6.3 (Sequence only works for lists)</span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> (<span class="org-haskell-constructor">Just</span> [1, 2, 3, 4])

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>8<span class="org-haskell-constructor">:</span>11<span class="org-haskell-constructor">:</span>
    <span class="org-haskell-constructor">Couldn't</span> match expected <span class="org-haskell-keyword">type</span> `[m0 a0]'
                with actual <span class="org-haskell-keyword">type</span> `<span class="org-haskell-type">Maybe</span> [t0]'
    <span class="org-haskell-constructor">In</span> the return <span class="org-haskell-keyword">type</span> <span class="org-haskell-keyword">of</span> a call <span class="org-haskell-keyword">of</span> `<span class="org-haskell-constructor">Just'</span>

<span class="org-comment-delimiter">--</span><span class="org-comment">- Haskell 7.10.2 (Sequence was generalized)</span>
<span class="org-comment-delimiter">--</span><span class="org-comment">-</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> (<span class="org-haskell-constructor">Just</span> [1, 2, 3, 4])
[<span class="org-haskell-constructor">Just</span> 1,<span class="org-haskell-constructor">Just</span> 2,<span class="org-haskell-constructor">Just</span> 3,<span class="org-haskell-constructor">Just</span> 4]
<span class="org-haskell-operator">&gt;</span> 



<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> [<span class="org-haskell-constructor">Just</span> 1, <span class="org-haskell-constructor">Just</span> 2, <span class="org-haskell-constructor">Just</span> 3, <span class="org-haskell-constructor">Just</span> 4] 
<span class="org-haskell-constructor">Just</span> [1,2,3,4]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> [<span class="org-haskell-constructor">Just</span> 1, <span class="org-haskell-constructor">Just</span> 2, <span class="org-haskell-constructor">Just</span> 3, <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">Just</span> 4, <span class="org-haskell-constructor">Nothing</span>] 
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> [<span class="org-haskell-constructor">Right</span> 1, <span class="org-haskell-constructor">Right</span> 2, <span class="org-haskell-constructor">Right</span> 3, <span class="org-haskell-constructor">Right</span> 4]
<span class="org-haskell-constructor">Right</span> [1,2,3,4] 
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> [<span class="org-haskell-constructor">Right</span> 10, <span class="org-haskell-constructor">Left</span> <span class="org-string">"Error 0"</span>, <span class="org-haskell-constructor">Left</span> <span class="org-string">"Error 1"</span>, <span class="org-haskell-constructor">Left</span> <span class="org-string">"Error 2"</span>] 
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error 0"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> [<span class="org-haskell-constructor">Right</span> 10, <span class="org-haskell-constructor">Right</span> 20, <span class="org-haskell-constructor">Left</span> <span class="org-string">"Error 1"</span>, <span class="org-haskell-constructor">Right</span> 4] 
<span class="org-haskell-constructor">Left</span> <span class="org-string">"Error 1"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t [putStrLn <span class="org-string">"line1"</span>, putStrLn <span class="org-string">"line2"</span>, putStrLn <span class="org-string">"line3"</span>]
[putStrLn <span class="org-string">"line1"</span>, putStrLn <span class="org-string">"line2"</span>, putStrLn <span class="org-string">"line3"</span>] <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> [putStrLn <span class="org-string">"line1"</span>, putStrLn <span class="org-string">"line2"</span>, putStrLn <span class="org-string">"line3"</span>]
line1
line2
line3
[<span class="org-haskell-constructor">()</span>,<span class="org-haskell-constructor">()</span>,<span class="org-haskell-constructor">()</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> inputNunmber <span class="org-haskell-operator">=</span> getLine <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span> str <span class="org-haskell-operator">-&gt;</span> return <span class="org-haskell-operator">$</span> (read str <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integer</span>)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t inputNunmber 
<span class="org-haskell-definition">inputNunmber</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> actions <span class="org-haskell-operator">=</span> [inputNunmber, inputNunmber, inputNunmber]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t actions 
<span class="org-haskell-definition">actions</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">IO</span> <span class="org-haskell-type">Integer</span>]
<span class="org-haskell-operator">&gt;</span> 

 <span class="org-comment-delimiter">-- </span><span class="org-comment">Only works in the repl (&lt;-) to extract content from IO Monad.</span>

<span class="org-haskell-operator">&gt;</span> out <span class="org-haskell-operator">&lt;-</span> sequence actions 
23
100
200
<span class="org-haskell-operator">&gt;</span> out
[23,100,200]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t out
<span class="org-haskell-definition">out</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Integer</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> actions 
200
30
50
[200,30,50]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t sequence actions 
<span class="org-haskell-definition">sequence</span> actions <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> [<span class="org-haskell-type">Integer</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad.Identity</span>
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence</span> [<span class="org-haskell-constructor">Identity</span> 20, <span class="org-haskell-constructor">Identity</span> 10, <span class="org-haskell-constructor">Identity</span> 30]
<span class="org-haskell-constructor">Identity</span> [20,10,30]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
