haskell/control_monad.org
** sequence_

Evaluate each monadic action in the structure from left to right, and
ignore the results. For a version that doesn't ignore the results see
sequence. (documentation).

#+BEGIN_SRC haskell
-- Haskell 7.6.3. Most of texts and lectures notes refers 
-- to the old implementation of sequence_. 
--
sequence_ :: Monad m => [m a] -> m ()
sequence_ = foldr (>>) (return ())

-- Haskell 7.10.2
sequence_ :: (Monad m, Foldable t) => t (m a) -> m ()

#+END_SRC

Examples:

#+BEGIN_SRC haskell 

(>>) :: Monad m => m a -> m b -> m b
(>>) ma mb = 
     ma >>= \ _ ->  mb 

> putStrLn "hello world" >> putStrLn "Hola mundo"
hello world
Hola mundo
> 

--  Haskell 7.10.2 and Haskell 7.6.3 
--
> sequence_ [putStrLn "Line 1", putStrLn "Line 2", putStrLn "Line 3"]
Line 1
Line 2
Line 3
> 

--  Haskell 7.10.2 only. 
--
> sequence_ $ Just (putStrLn "Hello world")
Hello world
> 
> :t sequence_ $ Just (putStrLn "Hello world")
sequence_ $ Just (putStrLn "Hello world") :: IO ()
> 

> sequence_ $ Just ([1, 2, 3, 4, 5])
[(),(),(),(),()]
> 
> sequence_ $ Nothing
> 


#+END_SRC

** foldM

#+BEGIN_SRC haskell 
-- Haskell 7.6.3
-- 
foldM :: Monad m => (a -> b -> m a) -> a -> [b] -> m a
foldM f a []     = return a 
foldM f a (x:xs) =  f a x >>= \ fax -> foldM f fax xs

-- Haskell 7.10.2 
--
foldM  :: (Monad m, Foldable t) => (b -> a -> m b) -> b -> t a -> m b
foldM = ???


-- foldM Intutition 

foldM f acc0  [x0, x1, x2, ... xn] = do  acc1 <- f acc0 x0 
                                         acc2 <- f acc1 x1 
                                         acc3 <- f acc2 x2
                                         ...
                                         f an xn 
                                      

#+END_SRC

Example:

#+BEGIN_SRC haskell
> import Control.Identity.Monad

> foldM (\acc x -> Identity (10 * acc + x)) 0 [1, 2, 3, 4, 5]
Identity 12345
> 

> foldM (\acc x -> Just (10 * acc + x)) 0 [1, 2, 3, 4, 5]
Just 12345
> 

-- If the functions returns Nothing, the whole computation fails:
-- returns Nothing 
-- 
> foldM (\acc x -> if x > 3 then Nothing else Just (10 * acc + x)) 0 [1, 2, 3, 4, 5]
Nothing
> 

> foldM (\acc x -> return (10 * acc + x) :: IO Integer) 0 [1, 2, 3, 4, 5]
12345
> :t foldM (\acc x -> return (10 * acc + x) :: IO Integer) 0 [1, 2, 3, 4, 5]
foldM (\acc x -> return (10 * acc + x) :: IO Integer) 0 [1, 2, 3, 4, 5]
  :: IO Integer
> 



#+END_SRC

