haskell/control_monad.html

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> sequence_</h3>
<div class="outline-text-3" id="text-1-11">
<p>
Evaluate each monadic action in the structure from left to right, and
ignore the results. For a version that doesn't ignore the results see
sequence. (documentation).
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.6.3. Most of texts and lectures notes refers </span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">to the old implementation of sequence_. </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-definition">sequence_</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> [m a] <span class="org-haskell-operator">-&gt;</span> m <span class="org-haskell-constructor">()</span>
<span class="org-haskell-definition">sequence_</span> <span class="org-haskell-operator">=</span> foldr (<span class="org-haskell-operator">&gt;&gt;</span>) (return <span class="org-haskell-constructor">()</span>)

<span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.10.2</span>
<span class="org-haskell-definition">sequence_</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monad</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> t (m a) <span class="org-haskell-operator">-&gt;</span> m <span class="org-haskell-constructor">()</span>
</pre>
</div>

<p>
Examples:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

(<span class="org-haskell-definition">&gt;&gt;</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> m a <span class="org-haskell-operator">-&gt;</span> m b <span class="org-haskell-operator">-&gt;</span> m b
(<span class="org-haskell-definition">&gt;&gt;</span>) ma mb <span class="org-haskell-operator">=</span> 
     ma <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span> <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">-&gt;</span>  mb 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">putStrLn</span> <span class="org-string">"hello world"</span> <span class="org-haskell-operator">&gt;&gt;</span> putStrLn <span class="org-string">"Hola mundo"</span>
<span class="org-haskell-definition">hello</span> world
<span class="org-haskell-constructor">Hola</span> mundo
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">--  </span><span class="org-comment">Haskell 7.10.2 and Haskell 7.6.3 </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sequence_</span> [putStrLn <span class="org-string">"Line 1"</span>, putStrLn <span class="org-string">"Line 2"</span>, putStrLn <span class="org-string">"Line 3"</span>]
<span class="org-haskell-constructor">Line</span> 1
<span class="org-haskell-constructor">Line</span> 2
<span class="org-haskell-constructor">Line</span> 3
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">--  </span><span class="org-comment">Haskell 7.10.2 only. </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> sequence_ <span class="org-haskell-definition">$</span> <span class="org-haskell-constructor">Just</span> (putStrLn <span class="org-string">"Hello world"</span>)
<span class="org-haskell-constructor">Hello</span> world
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t sequence_ <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Just</span> (putStrLn <span class="org-string">"Hello world"</span>)
sequence_ <span class="org-haskell-definition">$</span> <span class="org-haskell-constructor">Just</span> (putStrLn <span class="org-string">"Hello world"</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-constructor">()</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> sequence_ <span class="org-haskell-definition">$</span> <span class="org-haskell-type">Just</span> ([1, 2, 3, 4, 5])
[<span class="org-haskell-constructor">()</span>,<span class="org-haskell-constructor">()</span>,<span class="org-haskell-constructor">()</span>,<span class="org-haskell-constructor">()</span>,<span class="org-haskell-constructor">()</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> sequence_ <span class="org-haskell-definition">$</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> foldM</h3>
<div class="outline-text-3" id="text-1-12">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.6.3</span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-definition">foldM</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monad</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> m a) <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> m a
<span class="org-haskell-definition">foldM</span> f a <span class="org-haskell-constructor">[]</span>     <span class="org-haskell-operator">=</span> return a 
<span class="org-haskell-definition">foldM</span> f a (x<span class="org-haskell-constructor">:</span>xs) <span class="org-haskell-operator">=</span>  f a x <span class="org-haskell-operator">&gt;&gt;=</span> <span class="org-haskell-operator">\</span> fax <span class="org-haskell-operator">-&gt;</span> foldM f fax xs

<span class="org-comment-delimiter">-- </span><span class="org-comment">Haskell 7.10.2 </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-definition">foldM</span>  <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monad</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> (b <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> m b) <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m b
<span class="org-haskell-definition">foldM</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">???</span>


<span class="org-comment-delimiter">-- </span><span class="org-comment">foldM Intutition </span>

<span class="org-haskell-definition">foldM</span> f acc0  [x0, x1, x2, <span class="org-haskell-operator">...</span> xn] <span class="org-haskell-operator">=</span> <span class="org-haskell-keyword">do</span>  acc1 <span class="org-haskell-operator">&lt;-</span> f acc0 x0 
                                         acc2 <span class="org-haskell-operator">&lt;-</span> f acc1 x1 
                                         acc3 <span class="org-haskell-operator">&lt;-</span> f acc2 x2
                                         <span class="org-haskell-operator">...</span>
                                         f an xn
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Monad</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Control.Identity.Monad</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldM</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Identity</span> (10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x)) 0 [1, 2, 3, 4, 5]
<span class="org-haskell-constructor">Identity</span> 12345
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldM</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Just</span> (10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x)) 0 [1, 2, 3, 4, 5]
<span class="org-haskell-constructor">Just</span> 12345
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">If the functions returns Nothing, the whole computation fails:</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">returns Nothing </span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldM</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">if</span> x <span class="org-haskell-operator">&gt;</span> 3 <span class="org-haskell-keyword">then</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-keyword">else</span> <span class="org-haskell-constructor">Just</span> (10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x)) 0 [1, 2, 3, 4, 5]
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldM</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> return (10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Integer</span>) 0 [1, 2, 3, 4, 5]
12345
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t foldM (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> return (10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Integer</span>) 0 [1, 2, 3, 4, 5]
<span class="org-haskell-definition">foldM</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> return (10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Integer</span>) 0 [1, 2, 3, 4, 5]
  <span class="org-haskell-operator">::</span> <span class="org-haskell-type">IO</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: arch</p>
<p class="date">Created: 2017-03-04 sáb 14:19</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>